#+TITLE: November 12-27, 2019 (16 days)
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2019-11-12 Tue>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 1
  :wpd-kurianbenoy: 1
  :wpd-sandeepk: 1
  :wpd-sidntrivedi: 1
  :END:
** akshay196
*** DONE Mastering Python’s pytest
    CLOSED: [2019-11-13 Wed 21:41]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:   3.18
    :OWNER: akshay196
    :ID: READ.1573573996
    :TASKID: READ.1573573996
    :END:
    :LOGBOOK:
    CLOCK: [2019-11-13 Wed 18:30]--[2019-11-13 Wed 21:41] =>  3:11
    :END:
    https://learning.oreilly.com/live-training/courses/mastering-pythons-pytest/0636920324614/
*** IN_PROGRESS Test-Driven Development with Python - Part I [4/12]
    :PROPERTIES:
    :ESTIMATED: 13
    :ACTUAL:   4.30
    :OWNER: akshay196
    :ID: READ.1573574122
    :TASKID: READ.1573574122
    :END:
    :LOGBOOK:
    CLOCK: [2019-11-21 Thu 09:07]--[2019-11-21 Thu 09:37] =>  0:30
    CLOCK: [2019-11-20 Wed 08:20]--[2019-11-20 Wed 09:23] =>  1:03
    CLOCK: [2019-11-19 Tue 07:45]--[2019-11-19 Tue 07:57] =>  0:12
    CLOCK: [2019-11-18 Mon 21:40]--[2019-11-18 Mon 21:46] =>  0:06
    CLOCK: [2019-11-17 Sun 20:31]--[2019-11-17 Sun 21:33] =>  1:02
    CLOCK: [2019-11-17 Sun 09:15]--[2019-11-17 Sun 09:54] =>  0:39
    CLOCK: [2019-11-15 Fri 19:36]--[2019-11-15 Fri 20:22] =>  0:46
    :END:
    2nd Edition
    By Harry J.W. Percival
    https://learning.oreilly.com/library/view/test-driven-development-with/9781491958698/
    - [X] Chapter 01. Getting Django Set Up Using a Functional Test                                 (1h)
    - [X] Chapter 02. Extending Our Functional Test Using the unittest Module                       (1h)
    - [X] Chapter 03. Testing a Simple Home Page with Unit Tests                                    (1h)
    - [X] Chapter 04. What Are We Doing with All These Tests? (And, Refactoring)                    (1h)
    - [ ] Chapter 05. Saving User Input: Testing the Database                                       (1h)
    - [ ] Chapter 06. Improving Functional Tests: Ensuring Isolation and Removing Voodoo Sleeps     (1h)
    - [ ] Chapter 07. Working Incrementally                                                         (2h)
    - [ ] Chapter 08. Prettification: Layout and Styling, and What to Test About It                 (1h)
    - [ ] Chapter 09. Testing Deployment Using a Staging Site                                       (1h)
    - [ ] Chapter 10. Getting to a Production-Ready Deployment                                      (1h)
    - [ ] Chapter 11. Automating Deployment with Fabric                                             (1h)
    - [ ] Chapter 12. Splitting Our Tests into Multiple Files, and a Generic Wait Helper            (1h)

** bhavin192
*** IN_PROGRESS CKAD exam preparation [3/8]
    :PROPERTIES:
    :ESTIMATED: 16
    :ACTUAL:   5.60
    :OWNER:    bhavin192
    :ID:       OPS.1573711071
    :TASKID:   OPS.1573711071
    :END:
    :LOGBOOK:
    CLOCK: [2019-11-24 Sun 20:06]--[2019-11-24 Sun 21:11] =>  1:05
    CLOCK: [2019-11-23 Sat 22:35]--[2019-11-23 Sat 23:20] =>  0:45
    CLOCK: [2019-11-23 Sat 19:18]--[2019-11-23 Sat 19:25] =>  0:07
    CLOCK: [2019-11-23 Sat 17:51]--[2019-11-23 Sat 18:18] =>  0:27
    CLOCK: [2019-11-23 Sat 16:34]--[2019-11-23 Sat 17:15] =>  0:41
    CLOCK: [2019-11-20 Wed 20:11]--[2019-11-20 Wed 20:31] =>  0:20
    CLOCK: [2019-11-19 Tue 21:07]--[2019-11-19 Tue 22:17] =>  1:10
    CLOCK: [2019-11-19 Tue 20:07]--[2019-11-19 Tue 20:18] =>  0:11
    CLOCK: [2019-11-17 Sun 18:51]--[2019-11-17 Sun 19:41] =>  0:50
    :END:
    https://github.com/dgkanatsios/CKAD-exercises
    - [X] Core Concepts (13%)                (3.0h)
    - [X] Multi-container Pods (10%)         (0.5h)
    - [X] Pod design (20%)                   (3.0h)
    - [ ] Configuration (18%)                (2.0h)
    - [ ] Observability (18%)                (1.0h)
    - [ ] Services and Networking (13%)      (1.0h)
    - [ ] State Persistence (8%)             (2.0h)
    - [ ] Practice                           (3.5h)

** gandalfdwite
*** TODO Attend RootConf Hyderabad [0/1]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: EVENT.1573404914
    :TASKID: EVENT.1573404914
    :END:
    - [ ] Attend RootConf Hyderabad on 16th November   ( 3h )
*** TODO Linux Under the Hood (Part - I) [0/6]
    :PROPERTIES:
    :ESTIMATED: 24
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: READ.1573405076
    :TASKID: READ.1573405076
    :END:
    - [ ] 1. How Linux is organized                      ( 2h )
    - [ ] 2. About C code, scripts and compiled programs ( 3h )
    - [ ] 3. Understanding linux commands                ( 2h )
    - [ ] 4. Understaning Linux boot process             ( 2h )
    - [ ] 5. Understanding Linux storage                 ( 3h )
    - [ ] 6. Understanding memory management             ( 1h )
** kurianbenoy
*** Read Cracking the Coding interview [0/3]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:
    :OWNER: kurianbenoy
    :ID: READ.1573947970
    :TASKID: READ.1573947970
    :END:
    - [ ] Trees chapter       (3h)
    - [ ] Bit Manipulation    (2h)
    - [ ] Dynamic Programming (3h)
*** Onboard GCI participants and create tasks for TF [0/2]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: kurianbenoy
    :ID: DEV.1573948136
    :TASKID: DEV.1573948136
    :END:
    - [ ] Understand Swift4TF codebase (2h)
    - [ ] Create task for GCI (3h)
*** Write a new kaggle kernel on Kaggle survey 2019
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: kurianbenoy
    :ID: DEV.1573948303
    :TASKID: DEV.1573948303
    :END:
** sandeepk
*** Fluent Python Part I [/1]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: sandeepk
    :ID: READ.1573385682
    :TASKID: READ.1573385682
    :END:
    - [ ] Chapter-6  Design Patterns with First-Class Functions (6h)
*** IN_PROGRESS Data Structure Part I [/3]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:   2.08
    :OWNER: sandeepk
    :ID: READ.1573385745
    :TASKID: READ.1573385745
    :END:
    :LOGBOOK:
    CLOCK: [2019-11-18 Mon 09:35]--[2019-11-18 Mon 10:05] =>  0:30
    CLOCK: [2019-11-15 Fri 09:30]--[2019-11-15 Fri 10:00] =>  0:30
    CLOCK: [2019-11-14 Thu 09:35]--[2019-11-14 Thu 10:00] =>  0:25
    CLOCK: [2019-11-13 Wed 09:10]--[2019-11-13 Wed 09:50] =>  0:40
    :END:
    - [ ] Arrays  (4h)
    - [ ] Maths   (3h)
    - [ ] Strings (3h)

** sidntrivedi
*** TODO Eloquent Javascript [0/7] (https://eloquentjavascript.net)
    :PROPERTIES:
    :ESTIMATED: 7
    :ACTUAL:
    :OWNER:    sidntrivedi
    :ID:       READ.1573482054
    :TASKID:   READ.1573482054
    :END:
    - [ ] Values, Types, and Operators
    - [ ] Program Structure
    - [ ] Functions
    - [ ] Data Structures: Objects and Arrays
    - [ ] Higher-order Functions
    - [ ] The Secret Life of Objects
    - [ ] Project: A Robot
*** TODO Computer Networking by Kurose [0/1]
   :PROPERTIES:
   :ESTIMATED: 7
   :ACTUAL:
   :OWNER: sidntrivedi
   :ID: READ.1573482623
   :TASKID: READ.1573482623
   :END:
   - [ ] Computer Networks & the Internet
   - [ ] Application Layer
*** TODO Write Pycon India Blog[0/1].
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER:    sidntrivedi
    :ID:       WRITE.1573380388
    :TASKID:   WRITE.1573380388
    :END:
